//Задача 36: Задайте одномерный массив, заполненный случайными числами. Найдите сумму элементов, стоящих на нечётных позициях.

int[] GetArray(int size, int minValue, int maxValue) 
{
    int[] array = new int[size];
    for(int i = 0; i < size; i++)
    {
        array[i] = new Random().Next(minValue, maxValue + 1);
    }
    return array;
}

int GetChangeArray(int[] array)
{
    int sum = 0;
    for(int i = 1; i < array.Length; i += 2)
    {
        sum += array[i];
    }
    return sum;
}    

int[] array = GetArray(4, 10, 40);
Console.WriteLine(String.Join(",", array));
Console.WriteLine($"Сумма нечетных чисел -> {String.Join(", ", GetChangeArray(array))}");